IDEA Open Model
SetupValue Class
Compatible with IDEA StatiCa 20.1
 Setup value base
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Concrete.SetupValue
 More...
 Namespace: IdeaRS.OpenModel.Concrete
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public abstract class SetupValue
Public MustInherit Class SetupValue
The SetupValue type exposes the following members.
Constructors
Name | Description
SetupValue
Initializes a new instance of the SetupValue class
Top
Properties
Name | Description
Id
 Gets or sets the value id.
Top
See Also
Reference
IdeaRS.OpenModel.Concrete Namespace
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Concrete.SetupValue
 IdeaRS.OpenModel.Concrete.SetupValueBool
 IdeaRS.OpenModel.Concrete.SetupValueDouble
 IdeaRS.OpenModel.Concrete.SetupValueFloat
 IdeaRS.OpenModel.Concrete.SetupValueInt
 IdeaRS.OpenModel.Concrete.SetupValueLong
 IdeaRS.OpenModel.Concrete.SetupValueShort